Q1>Create and import file
1. Create boys Boysfriend_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality) ,
2. Create girls Girlsfriend_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality),
3. Append two dataframes and print data.

In [1]:
boysfriends={"boys":("harsha","hari","varun","vamsi","imran"),
     "quality":("irritaing","intelligent","anxious","comedian","trader")}

In [2]:
import pandas
import pandas as pd
boys=pd.DataFrame(boysfriends)

In [3]:
boys

     boys      quality
0  harsha    irritaing
1    hari  intelligent
2   varun      anxious
3   vamsi     comedian
4   imran       trader

In [38]:
boys

     boys      quality   girls
0  harsha    irritaing  harsha
1    hari  intelligent    hari
2   varun      anxious   varun
3   vamsi     comedian   vamsi
4   imran       trader   imran

In [4]:
df1=pd.read_excel(r"E:\Santhosh\pandas_assign11\boysfriends.xlsx")
df1

     name      quality
0  harsha   irritating
1    hari  intelligent
2   varun      anxious
3   vamsi     comedian
4   imran       trader

In [5]:
df2=pd.read_excel(r"E:\Santhosh\pandas_assign11\girlsfriends.xlsx")
df2

        name   quality
0    lavanya    topper
1    supraja  childish
2   prasanna    strong
3   bhargavi    topper
4  meenakshi   selfish

In [6]:
import pandas 
import pandas as pd
df1=pd.read_excel(r"E:\Santhosh\pandas_assign11\boysfriends.xlsx")
df1

     name      quality
0  harsha   irritating
1    hari  intelligent
2   varun      anxious
3   vamsi     comedian
4   imran       trader

In [7]:
df2=pd.read_excel(r"E:\Santhosh\pandas_assign11\boysfriends.xlsx",sheet_name="Sheet2")
df2

       names      quality
0    lavanya  intelligent
1    supraja     childish
2   prasanna       strong
3   bhargavi       topper
4  meenakshi      selfish

In [8]:
df_append = pd.concat([df1,df2],ignore_index='True')

In [9]:
df_append

     name      quality      names
0  harsha   irritating        NaN
1    hari  intelligent        NaN
2   varun      anxious        NaN
3   vamsi     comedian        NaN
4   imran       trader        NaN
5     NaN  intelligent    lavanya
6     NaN     childish    supraja
7     NaN       strong   prasanna
8     NaN       topper   bhargavi
9     NaN      selfish  meenakshi

In [10]:
sisters={"name":("sravanthi","sravani","balu","divya","navya"),
     "relation":("elder_sister","younger_sister","cousin_sister","sisterinlaw","sisterinlaw")}

In [11]:
sisters

{'name': ('sravanthi', 'sravani', 'balu', 'divya', 'navya'),
 'relation': ('elder_sister',
  'younger_sister',
  'cousin_sister',
  'sisterinlaw',
  'sisterinlaw')}

In [12]:
brothers={"name":("nani","sunny","chinna","anand","ahmed"),
         "relation":("elderbrother","youngerbrother","cousinbrother","brotherinlaw","giftedbrother")}

In [13]:
brothers

{'name': ('nani', 'sunny', 'chinna', 'anand', 'ahmed'),
 'relation': ('elderbrother',
  'youngerbrother',
  'cousinbrother',
  'brotherinlaw',
  'giftedbrother')}

In [14]:
dfb=pd.DataFrame(brothers)

In [15]:
dfb

     name        relation
0    nani    elderbrother
1   sunny  youngerbrother
2  chinna   cousinbrother
3   anand    brotherinlaw
4   ahmed   giftedbrother

In [16]:
dfs=pd.DataFrame(sisters)

In [17]:
dfs

        name        relation
0  sravanthi    elder_sister
1    sravani  younger_sister
2       balu   cousin_sister
3      divya     sisterinlaw
4      navya     sisterinlaw

In [18]:
import pandas
import pandas as pd
df_append=pd.concat([dfs,dfb],ignore_index="True")
df_append

        name        relation
0  sravanthi    elder_sister
1    sravani  younger_sister
2       balu   cousin_sister
3      divya     sisterinlaw
4      navya     sisterinlaw
5       nani    elderbrother
6      sunny  youngerbrother
7     chinna   cousinbrother
8      anand    brotherinlaw
9      ahmed   giftedbrother

In [19]:
soup_items={"soup":("chiken","mutton","fish","bendakai","egg"),
           "taste":("spicy","good","super","notbad","salty")}

In [20]:
soup_items

{'soup': ('chiken', 'mutton', 'fish', 'bendakai', 'egg'),
 'taste': ('spicy', 'good', 'super', 'notbad', 'salty')}

In [21]:
dfs=pd.DataFrame(soup_items)

In [22]:
dfs

       soup   taste
0    chiken   spicy
1    mutton    good
2      fish   super
3  bendakai  notbad
4       egg   salty

In [23]:
fry_items={"fry":("chicken","mutton","fish","prawns","egg"),
          "taste":("good","verygood","notbad","bad","spicy")}

In [24]:
dff=pd.DataFrame(fry_items)

In [25]:
dff

       fry     taste
0  chicken      good
1   mutton  verygood
2     fish    notbad
3   prawns       bad
4      egg     spicy

In [26]:
dffs=pd.concat([dff,dfs],ignore_index="True")

In [27]:
dffs

       fry     taste      soup
0  chicken      good       NaN
1   mutton  verygood       NaN
2     fish    notbad       NaN
3   prawns       bad       NaN
4      egg     spicy       NaN
5      NaN     spicy    chiken
6      NaN      good    mutton
7      NaN     super      fish
8      NaN    notbad  bendakai
9      NaN     salty       egg

In [28]:
import pandas
import pandas as pd

In [29]:
dict1={"monthname":("january","febuary"),
      "season":("winter","winter")}

In [30]:
df1=pd.DataFrame(dict1)
df1

  monthname  season
0   january  winter
1   febuary  winter

In [31]:
dict2={"monthname":("may","june"),
      "season":("summer","summer")}

In [32]:
df2=pd.DataFrame(dict2)
df2

  monthname  season
0       may  summer
1      june  summer

In [33]:
dict3={"monthname":("august","september"),
      "season":("rainy","rainy")}

In [34]:
df3=pd.DataFrame(dict3)
df3

   monthname season
0     august  rainy
1  september  rainy

In [35]:
df_append=pd.concat([df1,df2,df3],ignore_index="True")
df_append

   monthname  season
0    january  winter
1    febuary  winter
2        may  summer
3       june  summer
4     august   rainy
5  september   rainy